results/result_express.log
 
========================================================== 
 
====================WARM-UP======================== 
============So 1. Jan 19:38:33 CET 2017 Warming up the API with 100000 requests
 
starting benchmark...
spawning thread #0: 1 total client(s). 100000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 21.62s, 4624.75 req/s, 3.22MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 69.71MB (73100000) total, 15.83MB (16600000) headers (space savings 0.00%), 49.78MB (52200000) data
                     min         max         mean         sd        +/- sd
time for request:      164us     17.99ms       215us       142us    97.03%
time for connect:      214us       214us       214us         0us   100.00%
time to 1st byte:    18.22ms     18.22ms     18.22ms         0us   100.00%
req/s           :    4624.84     4624.84     4624.84        0.00   100.00%
 
============So 1. Jan 19:38:54 CET 2017 API warmed up. 
 
====================END WARM-UP======================== 
=== Sleeping for 2s
====================BENCHMARK======================== 
============So 1. Jan 19:38:56 CET 2017 Running load test ...
starting benchmark...
spawning thread #0: 8 total client(s). 25000 total requests
spawning thread #1: 8 total client(s). 25000 total requests
spawning thread #2: 8 total client(s). 25000 total requests
spawning thread #3: 8 total client(s). 25000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 13.26s, 7543.65 req/s, 5.26MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 69.71MB (73100000) total, 15.83MB (16600000) headers (space savings 0.00%), 49.78MB (52200000) data
                     min         max         mean         sd        +/- sd
time for request:      208us     67.97ms      3.52ms      2.21ms    90.35%
time for connect:       64us      1.16ms       342us       285us    87.50%
time to 1st byte:     7.07ms     68.05ms     45.26ms     16.99ms    75.00%
req/s           :     235.91      351.52      291.84       47.03    40.63%
 
============So 1. Jan 19:39:09 CET 2017 Done ...
 
====================END BENCHMARK========================