results/result_express.log
 
========================================================== 
 
====================WARM-UP======================== 
============Sat Nov 19 10:21:36 CET 2016 Warming up the API with 100000 requests
 
starting benchmark...
spawning thread #0: 1 total client(s). 100000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 18.94s, 5280.47 req/s, 3.68MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 69.71MB (73100000) total, 15.83MB (16600000) headers (space savings 0.00%), 49.78MB (52200000) data
                     min         max         mean         sd        +/- sd
time for request:      157us     40.01ms       188us       150us    99.02%
time for connect:      368us       368us       368us         0us   100.00%
time to 1st byte:    40.39ms     40.39ms     40.39ms         0us   100.00%
req/s           :    5280.54     5280.54     5280.54        0.00   100.00%
 
============Sat Nov 19 10:21:55 CET 2016 API warmed up. 
 
====================END WARM-UP======================== 
=== Sleeping for 2s
====================BENCHMARK======================== 
============Sat Nov 19 10:21:57 CET 2016 Running load test ...
starting benchmark...
spawning thread #0: 8 total client(s). 25000 total requests
spawning thread #1: 8 total client(s). 25000 total requests
spawning thread #2: 8 total client(s). 25000 total requests
spawning thread #3: 8 total client(s). 25000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 17.80s, 5616.87 req/s, 3.92MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 69.71MB (73100000) total, 15.83MB (16600000) headers (space savings 0.00%), 49.78MB (52200000) data
                     min         max         mean         sd        +/- sd
time for request:      612us     27.09ms      5.69ms       542us    94.23%
time for connect:       76us      2.11ms       802us       535us    68.75%
time to 1st byte:    10.66ms     27.16ms     19.52ms      4.88ms    56.25%
req/s           :     175.54      175.66      175.62        0.04    78.13%
 
============Sat Nov 19 10:22:15 CET 2016 Done ...
 
====================END BENCHMARK========================