results/result_grizzly.log
 
========================================================== 
 
====================WARM-UP======================== 
============Sat Nov 19 10:22:35 CET 2016 Warming up the API with 100000 requests
 
starting benchmark...
spawning thread #0: 1 total client(s). 100000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 21.88s, 4570.07 req/s, 2.29MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 50.06MB (52494997) total, 7.44MB (7805835) headers (space savings 0.00%), 39.86MB (41800000) data
                     min         max         mean         sd        +/- sd
time for request:      102us    482.40ms       216us      1.56ms    99.17%
time for connect:       79us        79us        79us         0us   100.00%
time to 1st byte:      390us       390us       390us         0us   100.00%
req/s           :    4571.86     4571.86     4571.86        0.00   100.00%
 
============Sat Nov 19 10:22:56 CET 2016 API warmed up. 
 
====================END WARM-UP======================== 
=== Sleeping for 2s
====================BENCHMARK======================== 
============Sat Nov 19 10:22:58 CET 2016 Running load test ...
starting benchmark...
spawning thread #0: 8 total client(s). 25000 total requests
spawning thread #1: 8 total client(s). 25000 total requests
spawning thread #2: 8 total client(s). 25000 total requests
spawning thread #3: 8 total client(s). 25000 total requests
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 5.70s, 17543.53 req/s, 8.78MB/s
requests: 100000 total, 100000 started, 100000 done, 100000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 100000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 50.07MB (52497632) total, 7.44MB (7805760) headers (space savings 0.00%), 39.86MB (41800000) data
                     min         max         mean         sd        +/- sd
time for request:      114us     46.94ms      1.80ms      1.50ms    94.37%
time for connect:       65us       110us        83us         8us    68.75%
time to 1st byte:      487us      2.71ms      1.45ms       507us    68.75%
req/s           :     548.69      564.58      554.53        4.27    62.50%
 
============Sat Nov 19 10:23:04 CET 2016 Done ...
 
====================END BENCHMARK========================